/*
Navicat MySQL Data Transfer

Source Server         : 192.168.1.119
Source Server Version : 50621
Source Host           : 192.168.1.119:3306
Source Database       : yiletong

Target Server Type    : MYSQL
Target Server Version : 50621
File Encoding         : 65001

Date: 2015-07-25 12:43:34
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for customers
-- ----------------------------
DROP TABLE IF EXISTS `customers`;
CREATE TABLE `customers` (
  `id` int(11) NOT NULL DEFAULT '0',
  `terminal` text,
  `faren` text,
  `shanghuName` text,
  `tel` text,
  `discount` float DEFAULT NULL,
  `fengding` float DEFAULT NULL,
  `tixianfeiEles` float DEFAULT NULL,
  `tixianfei` float DEFAULT NULL,
  `bankName` text,
  `bankName2` varchar(64) DEFAULT NULL,
  `bankAccount` text,
  `status` int(11) DEFAULT '1',
  `province` varchar(20) DEFAULT NULL,
  `city` varchar(20) DEFAULT NULL,
  `bankName3` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of customers
-- ----------------------------
INSERT INTO `customers` VALUES ('1', '65878132', '詹彦城', '鼓楼区新中源陶瓷', '17097913883', '0.38', '0', '0.2', '0.2', '中国农业银行', '福建分行', '5187100012525939', '1', '福建', '福州', '鼓楼支行');
INSERT INTO `customers` VALUES ('2', '65734831', '林沈午', '永安市公路港通讯店', '17097913883', '0.38', '0', '0.2', '0.2', '中国农业银行', '福建分行', '5187100012525939', '1', '福建', '福州', '鼓楼支行');
INSERT INTO `customers` VALUES ('3', '65804054', '周水发', '台江区见亿食品商店', '17097913883', '0.38', '0', '0.2', '0.25', '中国农业银行', '福建分行', '5187100012525939', '1', '福建', '福州', '鼓楼支行');
INSERT INTO `customers` VALUES ('4', '66014565', '兰李琴', '福州市鼓楼区华安保险', '17097913883', '0.38', '0', '0.2', '0.2', '中国农业银行', '福建分行', '5187100012525939', '1', '福建', '福州', '鼓楼支行');
INSERT INTO `customers` VALUES ('5', '65810230', '姚德顺', '台江区永德家用电器商行', '17097913883', '0.4', '0', '0.2', '0.2', '中国农业银行', '福建分行', '5187100012525939', '1', '福建', '福州', '鼓楼支行');
INSERT INTO `customers` VALUES ('6', '65774305', '胡国平', '台江区黄鹤楼家用电器商行', '17097913883', '0.38', '0', '0.2', '0.2', '中国农业银行', '福建分行', '5187100012525939', '1', '福建', '福州', '鼓楼支行');
INSERT INTO `customers` VALUES ('8', '12341234', '1234', '12341234', '12341234', '1234', null, '0.2', '1212', '中国农业银行', '福建分行', '5187100012525939', '-1', '', null, '鼓楼支行');

-- ----------------------------
-- Table structure for erp_sequence
-- ----------------------------
DROP TABLE IF EXISTS `erp_sequence`;
CREATE TABLE `erp_sequence` (
  `tableName` text,
  `Val` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of erp_sequence
-- ----------------------------
INSERT INTO `erp_sequence` VALUES ('transactionLogs', '1809');
INSERT INTO `erp_sequence` VALUES ('customers', '8');
INSERT INTO `erp_sequence` VALUES ('transactionSum', '47');

-- ----------------------------
-- Table structure for transactionlogs
-- ----------------------------
DROP TABLE IF EXISTS `transactionlogs`;
CREATE TABLE `transactionlogs` (
  `id` int(11) NOT NULL DEFAULT '0',
  `terminal` text,
  `tradeName` text,
  `results` text,
  `shanghuName` text,
  `faren` text,
  `tradeMoney` float(10,2) DEFAULT NULL,
  `time` text,
  `finallyMoney` float(10,2) DEFAULT NULL,
  `cards` text,
  `jiesuantime` text,
  `jiesuanstatus` int(11) DEFAULT '1' COMMENT '记录标志，非结单标志',
  `record` varchar(255) DEFAULT NULL,
  `timeStr` text COMMENT '抓取来的时间格式',
  `resultCode` varchar(2) DEFAULT NULL COMMENT '结果代码',
  `discountMoney` float(4,2) DEFAULT NULL COMMENT 'pos机扣率收费',
  `tixianfeiMoney` float(4,2) DEFAULT NULL COMMENT 'T0收费',
  `status` int(11) DEFAULT NULL,
  `sumid` int(11) DEFAULT NULL COMMENT '结算编号',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of transactionlogs
-- ----------------------------
INSERT INTO `transactionlogs` VALUES ('1716', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '50001.00', '2015-07-23 00:07:22', '49711.00', null, null, '1', null, '20150723 000722', '00', '99.99', '99.99', '0', null);
INSERT INTO `transactionlogs` VALUES ('1717', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '40000.00', '2015-07-22 23:11:43', '39768.00', null, null, '1', null, '20150722 231143', '00', '99.99', '80.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1718', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '20000.00', '2015-07-22 17:41:35', '19884.00', null, null, '1', null, '20150722 174135', '00', '76.00', '40.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1719', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '20000.00', '2015-07-22 17:40:54', '19884.00', null, null, '1', null, '20150722 174054', '00', '76.00', '40.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1720', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '118.00', '2015-07-23 09:16:26', '117.31', null, null, '1', null, '20150723 091626', '00', '0.45', '0.24', '0', null);
INSERT INTO `transactionlogs` VALUES ('1721', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '100.00', '2015-07-22 19:04:31', '99.42', null, null, '1', null, '20150722 190431', '00', '0.38', '0.20', '0', null);
INSERT INTO `transactionlogs` VALUES ('1722', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '290.00', '2015-07-22 19:02:31', '288.32', null, null, '1', null, '20150722 190231', '00', '1.10', '0.58', '0', null);
INSERT INTO `transactionlogs` VALUES ('1723', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '2000.00', '2015-07-22 11:16:37', '1988.40', null, null, '1', null, '20150722 111637', '00', '7.60', '4.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1724', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '118.00', '2015-07-22 10:19:46', '117.31', null, null, '1', null, '20150722 101946', '00', '0.45', '0.24', '0', null);
INSERT INTO `transactionlogs` VALUES ('1725', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '200.00', '2015-07-22 01:31:16', '198.84', null, null, '1', null, '20150722 013116', '00', '0.76', '0.40', '0', null);
INSERT INTO `transactionlogs` VALUES ('1726', '65804054', '签退', '交易成功(00)', '台江区见亿食品商店', '周水发', '0.00', '2015-07-23 00:29:53', '0.00', null, null, '1', null, '20150723 002953', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1727', '65804054', '批上送结束(平账)', '交易成功(00)', '台江区见亿食品商店', '周水发', '0.00', '2015-07-23 00:29:50', '0.00', null, null, '1', null, '20150723 002950', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1728', '65804054', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '台江区见亿食品商店', '周水发', '200.00', '2015-07-23 00:29:46', '198.74', null, null, '1', null, '20150723 002946', '00', '0.76', '0.50', '1', '44');
INSERT INTO `transactionlogs` VALUES ('1729', '65804054', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '台江区见亿食品商店', '周水发', '176.00', '2015-07-23 00:29:43', '174.89', null, null, '1', null, '20150723 002943', '00', '0.67', '0.44', '1', '44');
INSERT INTO `transactionlogs` VALUES ('1730', '65804054', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '台江区见亿食品商店', '周水发', '1500.00', '2015-07-23 00:29:40', '1490.55', null, null, '1', null, '20150723 002940', '00', '5.70', '3.75', '1', '44');
INSERT INTO `transactionlogs` VALUES ('1731', '65804054', '结算', '交易成功(00)', '台江区见亿食品商店', '周水发', '0.00', '2015-07-23 00:29:36', '0.00', null, null, '1', null, '20150723 002936', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1732', '65804054', '消费', '交易成功(00)', '台江区见亿食品商店', '周水发', '58.00', '2015-07-22 23:25:06', '57.63', null, null, '1', null, '20150722 232506', '00', '0.22', '0.15', '0', null);
INSERT INTO `transactionlogs` VALUES ('1733', '65804054', '消费', '交易成功(00)', '台江区见亿食品商店', '周水发', '58.00', '2015-07-22 22:37:56', '57.63', null, null, '1', null, '20150722 223756', '00', '0.22', '0.15', '0', null);
INSERT INTO `transactionlogs` VALUES ('1734', '65804054', '消费', '交易成功(00)', '台江区见亿食品商店', '周水发', '58.00', '2015-07-22 20:38:43', '57.63', null, null, '1', null, '20150722 203843', '00', '0.22', '0.15', '0', null);
INSERT INTO `transactionlogs` VALUES ('1735', '65804054', '消费', '交易成功(00)', '台江区见亿食品商店', '周水发', '200.00', '2015-07-22 19:46:14', '198.74', null, null, '1', null, '20150722 194614', '00', '0.76', '0.50', '0', null);
INSERT INTO `transactionlogs` VALUES ('1736', '66014565', '消费', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '13988.00', '2015-07-22 18:08:05', '13906.87', null, null, '1', null, '20150722 180805', '00', '53.15', '27.98', '0', null);
INSERT INTO `transactionlogs` VALUES ('1737', '66014565', '签到双倍密钥', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '0.00', '2015-07-22 18:06:42', '0.00', null, null, '1', null, '20150722 180642', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1738', '66014565', '消费', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '9268.00', '2015-07-22 18:06:30', '9214.24', null, null, '1', null, '20150722 180630', '00', '35.22', '18.54', '0', null);
INSERT INTO `transactionlogs` VALUES ('1739', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '200.00', '2015-07-22 22:03:38', '198.80', null, null, '1', null, '20150722 220338', '00', '0.80', '0.40', '0', null);
INSERT INTO `transactionlogs` VALUES ('1740', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '900.00', '2015-07-22 20:17:33', '894.60', null, null, '1', null, '20150722 201733', '00', '3.60', '1.80', '0', null);
INSERT INTO `transactionlogs` VALUES ('1741', '65774305', '签到双倍密钥', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '0.00', '2015-07-23 09:32:09', '0.00', null, null, '1', null, '20150723 093209', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1742', '65774305', '签退', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '0.00', '2015-07-22 22:12:34', '0.00', null, null, '1', null, '20150722 221234', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1743', '65774305', '批上送结束(平账)', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '0.00', '2015-07-22 22:12:29', '0.00', null, null, '1', null, '20150722 221229', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1744', '65774305', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '1280.00', '2015-07-22 22:12:25', '1272.58', null, null, '1', null, '20150722 221225', '00', '4.86', '2.56', '1', '45');
INSERT INTO `transactionlogs` VALUES ('1745', '65774305', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '529.00', '2015-07-22 22:12:20', '525.93', null, null, '1', null, '20150722 221220', '00', '2.01', '1.06', '1', '45');
INSERT INTO `transactionlogs` VALUES ('1746', '65774305', '结算', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '0.00', '2015-07-22 22:12:16', '0.00', null, null, '1', null, '20150722 221216', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1747', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '1280.00', '2015-07-22 21:10:36', '1272.58', null, null, '1', null, '20150722 211036', '00', '4.86', '2.56', '0', null);
INSERT INTO `transactionlogs` VALUES ('1748', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '330.00', '2015-07-22 20:21:16', '328.09', null, null, '1', null, '20150722 202116', '00', '1.25', '0.66', '0', null);
INSERT INTO `transactionlogs` VALUES ('1749', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '340.00', '2015-07-22 20:17:08', '338.03', null, null, '1', null, '20150722 201708', '00', '1.29', '0.68', '0', null);
INSERT INTO `transactionlogs` VALUES ('1750', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '529.00', '2015-07-22 20:04:05', '525.93', null, null, '1', null, '20150722 200405', '00', '2.01', '1.06', '0', null);
INSERT INTO `transactionlogs` VALUES ('1751', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '6000.00', '2015-07-23 12:12:34', '5965.20', null, null, '1', null, '20150723 121234', '00', '22.80', '12.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1752', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '118.00', '2015-07-21 19:18:13', '117.31', null, null, '1', null, '20150721 191813', '00', '0.45', '0.24', '0', null);
INSERT INTO `transactionlogs` VALUES ('1753', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '300.00', '2015-07-21 18:18:20', '298.26', null, null, '1', null, '20150721 181820', '00', '1.14', '0.60', '0', null);
INSERT INTO `transactionlogs` VALUES ('1754', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '98.00', '2015-07-21 13:51:32', '97.43', null, null, '1', null, '20150721 135132', '00', '0.37', '0.20', '0', null);
INSERT INTO `transactionlogs` VALUES ('1755', '65734831', '消费', '账户内余额不足(51)', '永安市公路港通讯店', '林沈午', '311.00', '2015-07-21 09:20:30', '309.20', null, null, '1', null, '20150721 092030', '51', '1.18', '0.62', '0', null);
INSERT INTO `transactionlogs` VALUES ('1756', '65804054', '签到双倍密钥', '交易成功(00)', '台江区见亿食品商店', '周水发', '0.00', '2015-07-23 11:42:08', '0.00', null, null, '1', null, '20150723 114208', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1757', '66014565', '签到双倍密钥', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '0.00', '2015-07-21 22:17:46', '0.00', null, null, '1', null, '20150721 221746', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1758', '66014565', '签退', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '0.00', '2015-07-21 22:17:36', '0.00', null, null, '1', null, '20150721 221736', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1759', '66014565', '批上送结束(平账)', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '0.00', '2015-07-21 22:17:29', '0.00', null, null, '1', null, '20150721 221729', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1760', '66014565', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '0.02', '2015-07-21 22:17:28', '0.02', null, null, '1', null, '20150721 221728', '00', '0.00', '0.00', '1', '46');
INSERT INTO `transactionlogs` VALUES ('1761', '66014565', '结算', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '0.00', '2015-07-21 22:17:27', '0.00', null, null, '1', null, '20150721 221727', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1762', '66014565', '消费', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '0.02', '2015-07-21 22:17:01', '0.02', null, null, '1', null, '20150721 221701', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1763', '66014565', '签到双倍密钥', '交易成功(00)', '福州市鼓楼区华安保险', '兰李琴', '0.00', '2015-07-21 22:14:27', '0.00', null, null, '1', null, '20150721 221427', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1764', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '580.00', '2015-07-23 12:44:52', '576.52', null, null, '1', null, '20150723 124452', '00', '2.32', '1.16', '0', null);
INSERT INTO `transactionlogs` VALUES ('1765', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '600.00', '2015-07-21 20:22:54', '596.40', null, null, '1', null, '20150721 202254', '00', '2.40', '1.20', '0', null);
INSERT INTO `transactionlogs` VALUES ('1766', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '200.00', '2015-07-21 17:44:18', '198.80', null, null, '1', null, '20150721 174418', '00', '0.80', '0.40', '0', null);
INSERT INTO `transactionlogs` VALUES ('1767', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '410.00', '2015-07-21 12:50:21', '407.54', null, null, '1', null, '20150721 125021', '00', '1.64', '0.82', '0', null);
INSERT INTO `transactionlogs` VALUES ('1768', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '770.00', '2015-07-21 12:43:29', '765.38', null, null, '1', null, '20150721 124329', '00', '3.08', '1.54', '0', null);
INSERT INTO `transactionlogs` VALUES ('1769', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '1170.00', '2015-07-20 20:52:15', '1162.98', null, null, '1', null, '20150720 205215', '00', '4.68', '2.34', '0', null);
INSERT INTO `transactionlogs` VALUES ('1770', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '4000.00', '2015-07-20 20:51:41', '3976.00', null, null, '1', null, '20150720 205141', '00', '16.00', '8.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1771', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '80.00', '2015-07-19 23:28:54', '79.52', null, null, '1', null, '20150719 232854', '00', '0.32', '0.16', '0', null);
INSERT INTO `transactionlogs` VALUES ('1772', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '246.00', '2015-07-23 13:13:39', '244.58', null, null, '1', null, '20150723 131339', '00', '0.93', '0.49', '0', null);
INSERT INTO `transactionlogs` VALUES ('1773', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '2550.00', '2015-07-23 13:03:26', '2535.21', null, null, '1', null, '20150723 130326', '00', '9.69', '5.10', '0', null);
INSERT INTO `transactionlogs` VALUES ('1774', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '289.00', '2015-07-23 13:00:59', '287.32', null, null, '1', null, '20150723 130059', '00', '1.10', '0.58', '0', null);
INSERT INTO `transactionlogs` VALUES ('1775', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '10000.00', '2015-07-23 12:11:40', '9942.00', null, null, '1', null, '20150723 121140', '00', '38.00', '20.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1776', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '9000.00', '2015-07-23 12:10:44', '8947.80', null, null, '1', null, '20150723 121044', '00', '34.20', '18.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1777', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '1000.00', '2015-07-21 19:40:47', '994.20', null, null, '1', null, '20150721 194047', '00', '3.80', '2.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1778', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '9000.00', '2015-07-21 19:39:36', '8947.80', null, null, '1', null, '20150721 193936', '00', '34.20', '18.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1779', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '9999.00', '2015-07-21 19:38:35', '9941.00', null, null, '1', null, '20150721 193835', '00', '38.00', '20.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1780', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '830.00', '2015-07-23 21:48:19', '825.02', null, null, '1', null, '20150723 214819', '00', '3.32', '1.66', '0', null);
INSERT INTO `transactionlogs` VALUES ('1781', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '780.00', '2015-07-23 21:37:21', '775.32', null, null, '1', null, '20150723 213721', '00', '3.12', '1.56', '0', null);
INSERT INTO `transactionlogs` VALUES ('1782', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '650.00', '2015-07-23 20:29:40', '646.10', null, null, '1', null, '20150723 202940', '00', '2.60', '1.30', '0', null);
INSERT INTO `transactionlogs` VALUES ('1783', '65810230', '消费', '交易成功(00)', '台江区永德家用电器商行', '姚德顺', '240.00', '2015-07-23 20:13:21', '238.56', null, null, '1', null, '20150723 201321', '00', '0.96', '0.48', '0', null);
INSERT INTO `transactionlogs` VALUES ('1784', '65774305', '签退', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '0.00', '2015-07-23 21:40:28', '0.00', null, null, '1', null, '20150723 214028', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1785', '65774305', '批上送结束(平账)', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '0.00', '2015-07-23 21:40:23', '0.00', null, null, '1', null, '20150723 214023', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1786', '65774305', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '3100.00', '2015-07-23 21:40:20', '3082.02', null, null, '1', null, '20150723 214020', '00', '11.78', '6.20', '1', '47');
INSERT INTO `transactionlogs` VALUES ('1787', '65774305', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '539.00', '2015-07-23 21:40:15', '535.87', null, null, '1', null, '20150723 214015', '00', '2.05', '1.08', '1', '47');
INSERT INTO `transactionlogs` VALUES ('1788', '65774305', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '131.00', '2015-07-23 21:40:11', '130.24', null, null, '1', null, '20150723 214011', '00', '0.50', '0.26', '1', '47');
INSERT INTO `transactionlogs` VALUES ('1789', '65774305', 'IC卡批上送通知交易(联机平账)', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '335.00', '2015-07-23 21:40:07', '333.06', null, null, '1', null, '20150723 214007', '00', '1.27', '0.67', '1', '47');
INSERT INTO `transactionlogs` VALUES ('1790', '65774305', '结算', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '0.00', '2015-07-23 21:40:00', '0.00', null, null, '1', null, '20150723 214000', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1791', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '3100.00', '2015-07-23 21:07:52', '3082.02', null, null, '1', null, '20150723 210752', '00', '11.78', '6.20', '0', null);
INSERT INTO `transactionlogs` VALUES ('1792', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '448.00', '2015-07-23 21:06:57', '445.40', null, null, '1', null, '20150723 210657', '00', '1.70', '0.90', '0', null);
INSERT INTO `transactionlogs` VALUES ('1793', '65774305', '消费', '交易成功(00)', '台江区黄鹤楼家用电器商行', '胡国平', '539.00', '2015-07-23 21:02:05', '535.87', null, null, '1', null, '20150723 210205', '00', '2.05', '1.08', '0', null);
INSERT INTO `transactionlogs` VALUES ('1794', '65878132', '消费', '交易成功(00)', '鼓楼区新中源陶瓷', '詹彦城', '40600.00', '2015-07-23 21:12:03', '40364.52', null, null, '1', null, '20150723 211203', '00', '99.99', '81.20', '0', null);
INSERT INTO `transactionlogs` VALUES ('1795', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '300.00', '2015-07-23 22:43:07', '298.26', null, null, '1', null, '20150723 224307', '00', '1.14', '0.60', '0', null);
INSERT INTO `transactionlogs` VALUES ('1796', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '200.00', '2015-07-23 21:01:40', '198.84', null, null, '1', null, '20150723 210140', '00', '0.76', '0.40', '0', null);
INSERT INTO `transactionlogs` VALUES ('1797', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '236.00', '2015-07-23 20:58:08', '234.63', null, null, '1', null, '20150723 205808', '00', '0.90', '0.47', '0', null);
INSERT INTO `transactionlogs` VALUES ('1798', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '236.00', '2015-07-23 19:53:14', '234.63', null, null, '1', null, '20150723 195314', '00', '0.90', '0.47', '0', null);
INSERT INTO `transactionlogs` VALUES ('1799', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '118.00', '2015-07-23 19:24:50', '117.31', null, null, '1', null, '20150723 192450', '00', '0.45', '0.24', '0', null);
INSERT INTO `transactionlogs` VALUES ('1800', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '138.00', '2015-07-23 19:14:06', '137.20', null, null, '1', null, '20150723 191406', '00', '0.52', '0.28', '0', null);
INSERT INTO `transactionlogs` VALUES ('1801', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '300.00', '2015-07-23 17:09:50', '298.26', null, null, '1', null, '20150723 170950', '00', '1.14', '0.60', '0', null);
INSERT INTO `transactionlogs` VALUES ('1802', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '138.00', '2015-07-23 14:21:42', '137.20', null, null, '1', null, '20150723 142142', '00', '0.52', '0.28', '0', null);
INSERT INTO `transactionlogs` VALUES ('1803', '65804054', '消费', '交易成功(00)', '台江区见亿食品商店', '周水发', '58.00', '2015-07-23 21:04:55', '57.63', null, null, '1', null, '20150723 210455', '00', '0.22', '0.15', '0', null);
INSERT INTO `transactionlogs` VALUES ('1804', '65804054', '消费', '交易成功(00)', '台江区见亿食品商店', '周水发', '175.00', '2015-07-23 19:40:32', '173.89', null, null, '1', null, '20150723 194032', '00', '0.67', '0.44', '0', null);
INSERT INTO `transactionlogs` VALUES ('1805', '65804054', '消费', '交易成功(00)', '台江区见亿食品商店', '周水发', '210.00', '2015-07-23 18:58:00', '208.67', null, null, '1', null, '20150723 185800', '00', '0.80', '0.53', '0', null);
INSERT INTO `transactionlogs` VALUES ('1806', '65804054', '签退', '交易成功(00)', '台江区见亿食品商店', '周水发', '0.00', '2015-07-24 01:00:57', '0.00', null, null, '1', null, '20150724 010057', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1807', '65804054', '批上送结束(平账)', '交易成功(00)', '台江区见亿食品商店', '周水发', '0.00', '2015-07-24 01:00:54', '0.00', null, null, '1', null, '20150724 010054', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1808', '65804054', '结算', '交易成功(00)', '台江区见亿食品商店', '周水发', '0.00', '2015-07-24 01:00:50', '0.00', null, null, '1', null, '20150724 010050', '00', '0.00', '0.00', '0', null);
INSERT INTO `transactionlogs` VALUES ('1809', '65734831', '消费', '交易成功(00)', '永安市公路港通讯店', '林沈午', '98.00', '2015-07-24 09:31:30', '97.43', null, null, '1', null, '20150724 093130', '00', '0.37', '0.20', '0', null);

-- ----------------------------
-- Table structure for transactionsum
-- ----------------------------
DROP TABLE IF EXISTS `transactionsum`;
CREATE TABLE `transactionsum` (
  `id` int(11) NOT NULL,
  `terminal` text NOT NULL,
  `tradeMoney` float NOT NULL,
  `tixianfeiMoney` float NOT NULL,
  `discountMoney` float NOT NULL,
  `finallyMoney` float NOT NULL,
  `status` int(11) NOT NULL DEFAULT '0' COMMENT '0：正常，1：送盘，2：成功，-2：失败',
  `results` text,
  `createDate` datetime DEFAULT CURRENT_TIMESTAMP,
  `uploadDate` datetime DEFAULT NULL,
  `reciveDate` datetime DEFAULT NULL,
  `batchAmount` int(11) DEFAULT NULL COMMENT '笔数',
  `bankName` text,
  `bankName2` varchar(64) DEFAULT NULL,
  `bankName3` varchar(64) DEFAULT NULL,
  `province` varchar(20) DEFAULT NULL,
  `city` varchar(20) DEFAULT NULL,
  `tel` varchar(20) DEFAULT NULL,
  `batchCurrnum` varchar(20) DEFAULT NULL,
  `batchCount` int(4) DEFAULT NULL,
  `faren` varchar(50) DEFAULT NULL,
  `shanghuName` varchar(64) DEFAULT NULL,
  `bankAccount` varchar(32) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of transactionsum
-- ----------------------------
INSERT INTO `transactionsum` VALUES ('44', '65804054', '1876', '4.69', '7.13', '1864.18', '-2', '商户审核拒绝', '2015-07-23 09:53:38', '2015-07-23 09:53:47', '2015-07-24 09:38:14', null, '中国农业银行', '福建分行', '鼓楼支行', '福建', '福州', '17097913883', '201507230953471162', '3', '周水发', '台江区见亿食品商店', '5187100012525939');
INSERT INTO `transactionsum` VALUES ('45', '65774305', '1809', '3.62', '6.87', '1798.51', '-2', '商户审核拒绝', '2015-07-23 09:53:49', '2015-07-23 09:53:59', '2015-07-24 09:38:13', null, '中国农业银行', '福建分行', '鼓楼支行', '福建', '福州', '17097913883', '201507230953597746', '2', '胡国平', '台江区黄鹤楼家用电器商行', '5187100012525939');
INSERT INTO `transactionsum` VALUES ('46', '66014565', '0.02', '0', '0', '0.02', '-2', '商户审核拒绝', '2015-07-23 13:29:15', '2015-07-23 13:29:15', '2015-07-24 09:38:14', null, '中国农业银行', '福建分行', '鼓楼支行', '福建', '福州', '17097913883', '201507231329151013', '1', '兰李琴', '福州市鼓楼区华安保险', '5187100012525939');
INSERT INTO `transactionsum` VALUES ('47', '65774305', '4105', '8.21', '15.6', '4081.19', '-2', '商户审核拒绝', '2015-07-24 00:54:01', '2015-07-24 00:54:02', '2015-07-24 09:38:14', null, '中国农业银行', '福建分行', '鼓楼支行', '福建', '福州', '17097913883', '201507240054023580', '4', '胡国平', '台江区黄鹤楼家用电器商行', '5187100012525939');

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `userName` text NOT NULL,
  `password` text,
  `secretKey` text,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('0', 'yiletong', 'yiletong123', null);
